Repository: 84000/data-translation-memory
Catalog: toh190-v3.tmx
Source language: bo
Languages: en

source: །བཙུན་པ་རབ་འབྱོར་ཐེག་པ་ཆེན་པོ་ཇི་ལྟར་ཚད་མ་མཆིས་པ་དེ་བཞིན་དུ་རྣམ་པ་རྣམས་དང་། རྟགས་རྣམས་དང་། མཚན་མ་རྣམས་ཀྱང་ཚད་མ་མཆིས་སོ།
en: Honorable Subhūti, just as the Great Vehicle is immeasurable, so too are its aspects, signs, and features.”

source: །ཚེ་དང་ལྡན་པ་རབ་འབྱོར་གྱིས་བུད་མེད་དེ་ལ་གཞན་ཡང་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: Venerable Subhūti continued by asking the lady, “Elder sister, when you asked what I desire in going for alms, you were looking for faults in me.

source: །ཆེ་ཞེ་ཁྱོད་ཀྱིས་བདག་ལ་ཁྱོད་ཅི་ཞིག་འདོད་དེ་བསོད་སྙོམས་ལ་རྒྱུ་བར་བྱེད་ཅེས་གླགས་བཙལ་བ་དེ་ནི་དེ་བཞིན་གཤེགས་པ་ཆོས་ཀྱི་མངའ་བདག་ཉིད་ཀྱང་བསོད་སྙོམས་ལ་རྒྱུ་བ་མཛད་ན་ཁྱོད་ཀྱིས་དེ་བཞིན་གཤེགས་པ་ལ་ཡང་དེའི་གླགས་བཙལ་ལམ།
en: However, since the Thus-Gone One, the master of Dharma himself, also goes for alms, are you looking for faults in the Thus-Gone One as well?”

source: བུད་མེད་དེས་སྨྲས་པ། བཙུན་པ་རབ་འབྱོར་གལ་ཏེ་དེ་བཞིན་གཤེགས་པ་ཐབས་གང་གིས་བསོད་སྙོམས་ལ་རྒྱུ་བ་མཛད་པ་མཁྱེན་པ་ལྟ་ན་དེ་སྤོབས་པར་མཛོད་ཅིག །རབ་འབྱོར་གྱིས་སྨྲས་པ། ཆེ་ཞེ་དེ་བཞིན་གཤེགས་པ་ཐབས་ཇི་ལྟ་བུ་ཞིག་གིས་བསོད་སྙོམས་ལ་རྒྱུ་བ་མཛད། བུད་མེད་དེས་སྨྲས་པ།
en: “Honorable Subhūti,” said the lady, “if you know of the skillfulness with which the Thus-Gone One goes for alms, please say so.” “No, elder sister, with which skillfulness does the Thus-Gone One go for alms?”

source: བཙུན་པ་རབ་འབྱོར་དེ་བཞིན་གཤེགས་པ་ནི་དོན་གྱི་དབང་ཉི་ཤུ་རྩ་གཅིག་གཟིགས་ནས་བསོད་སྙོམས་ལ་རྒྱུ་བ་མཛད་དེ།
en: “Honorable Subhūti, the Thus-Gone One goes for alms because he sees twenty-one great purposes.

source: ཉི་ཤུ་རྩ་གཅིག་པོ་གང་ཞེ་ན།
en: And what are those twenty-one?

source: གཟུགས་ཀྱི་སྐུ་བཟང་པོ་བསྟན་པའི་ཕྱིར་དེ་བཞིན་གཤེགས་པ་བསོད་སྙོམས་ལ་རྒྱུ་བ་མཛད་དེ།
en: The Thus-Gone One goes for alms in order to display his excellent form body.

source: དེར་སེམས་ཅན་གང་དག་གིས་དེ་བཞིན་གཤེགས་པའི་སྐུ་སྐྱེས་བུ་ཆེན་པོའི་མཚན་སུམ་ཅུ་རྩ་གཉིས་ཀྱིས་བརྒྱན་པ་རྣམ་པ་ཐམས་ཅད་ཀྱི་མཆོག་དང་ལྡན་པ་མཐོང་བ་དེ་དག །དེ་བཞིན་གཤེགས་པའི་གཟུགས་ཀྱི་སྐུའི་མཚན་འཐོབ་པར་བགྱི་བའི་ཕྱིར། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་སྐྱེད་པར་བགྱིད་དེ།
en: Anyone who sees the body of the Thus-Gone One, adorned with the thirty-two marks of a great being and the best of all features, engenders the mind set upon unsurpassed and perfect awakening in order to attain the marks of the Thus-Gone One’s form body.

source: བཙུན་པ་རབ་འབྱོར་དེ་བཞིན་གཤེགས་པས་དོན་གྱི་དབང་དེ་གཟིགས་ནས་བསོད་སྙོམས་ལ་རྒྱུ་བ་མཛད་དོ།
en: It is through considering this great purpose, honorable Subhūti, that the Thus-Gone One goes for alms.

source: །བཙུན་པ་རབ་འབྱོར་གཞན་ཡང་དེ་བཞིན་གཤེགས་པ་གྲོང་དང་། གྲོང་ཁྱེར་དུ་བསོད་སྙོམས་ལ་གཤེགས་ན་སེམས་ཅན་ལོང་བ་རྣམས་ཀྱིས་ནི་གཟུགས་རྣམས་མཐོང་བར་འགྱུར།
en: “Furthermore, honorable Subhūti, when the Thus-Gone One goes to hamlets or cities for alms, those who are blind regain their sight.

source: སེམས་ཅན་འོན་པ་རྣམས་ཀྱིས་ནི་སྒྲ་ཐོས་པར་འགྱུར།
en: Those who are deaf can hear again.

source: སེམས་ཅན་སྨྱོན་པ་རྣམས་ཀྱིས་ནི་དྲན་པ་རྙེད་པར་འགྱུར།
en: The mad regain their senses.

source: སེམས་ཅན་གཅེར་བུ་རྣམས་ཀྱིས་ནི་གོས་རྙེད་པར་འགྱུར།
en: Those who are naked find clothing.

source: སེམས་ཅན་བཀྲེས་པ་རྣམས་ཀྱིས་ནི་ཟས་རྙེད་པར་འགྱུར།
en: Those who are hungry acquire food.

source: སེམས་ཅན་སྐོམ་པ་རྣམས་ཀྱིས་ནི་བཏུང་བ་རྙེད་པར་འགྱུར་ལ།
en: Those who are thirsty find drink.

source: སེམས་ཅན་སུ་ལ་ཡང་འདོད་ཆགས་སམ། ཞེ་སྡང་ངམ། གཏི་མུག་དང་། ཕྲག་དོག་དང་། སེར་སྣ་དང་། ཁྲོ་བ་དང་། རྒྱགས་པ་དང་། འཆབ་པ་དང་། ཡོངས་སུ་གདུང་བའི་གནོད་པ་མ་མཆིས་སོ།
en: And everyone without exception becomes free from the harms of passion, aggression, delusion, envy, stinginess, wrath, haughtiness, hypocrisy, and anguish.

source: །སེམས་ཅན་ཐམས་ཅད་བྱམས་པའི་སེམས་དང་ལྡན་ཏེ་གཅིག་ལ་གཅིག་ཕ་མའི་འདུ་ཤེས་སྐྱེད་པར་འགྱུར་ཏེ།
en: Everyone becomes loving and perceives others as their parents.

source: དེར་སེམས་ཅན་མང་པོས་དེ་བཞིན་གཤེགས་པ་གྲོང་དང་། གྲོང་ཁྱེར་དུ་གཤེགས་པའི་ཡོན་ཏན་ཕུན་སུམ་ཚོགས་པ་དེ་མཐོང་ནས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་སྐྱེད་པར་བགྱིད་དེ།
en: Since many beings behold these perfect qualities of the Thus-Gone One when he goes to hamlets or cities, they give rise to the mind set upon unsurpassed and perfect awakening.

source: །བཙུན་པ་རབ་འབྱོར་གཞན་ཡང་དེ་བཞིན་གཤེགས་པ་ནི་གྲོང་དང་། གྲོང་ཁྱེར་དང་། གྲོང་རྡལ་དུ་གཤེགས་ན། ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མིའམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་རྣམས་དང་། བརྒྱ་བྱིན་དང་། ཚངས་པ་དང་། འཇིག་རྟེན་སྐྱོང་བ་རྣམས་མཆོད་པའི་ལས་བགྱི་བའི་སླད་དུ་ཕྱི་བཞིན་དུ་འབྲང་སྟེ།
en: “Furthermore, honorable Subhūti, when the Thus-Gone One goes to hamlets, cities, and towns, gods, nāgas, yakṣas, gandharvas, asuras, garuḍas, kinnaras, mahoragas, Śakra, Brahmā, and the guardians of the world follow close behind, in order to offer him worship.

source: དེར་སངས་རྒྱས་ཀྱི་མཐུས་མི་རྣམས་ཀྱིས་ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མིའམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་རྣམས་དང་། བརྒྱ་བྱིན་དང་། ཚངས་པ་དང་། འཇིག་རྟེན་སྐྱོང་བ་རྣམས་བཅོམ་ལྡན་འདས་ལ་མཆོད་པ་བགྱིད་པ་མཐོང་ནས་དེ་དག་དེ་བཞིན་གཤེགས་པ་ལ་འདོད་པ་སྐྱེ་སྟེ། དེ་བཞིན་གཤེགས་པ་ནི་ངོ་མཚར་ཆེ་བ་ནས་རྨད་དུ་བྱུང་བའི་བར་གྱི་ཆོས་དང་ལྡན་ནོ་སྙམ་སྟེ།
en: By the power of the Buddha, humans are able to see gods, nāgas, yakṣas, gandharvas, asuras, garuḍas, kinnaras, mahoragas, Śakra, Brahmā, and the guardians of the world worshiping the Blessed One.

source: དེ་དག་གིས་དེ་བཞིན་གཤེགས་པ་ལ་འདོད་པ་བསྐྱེད་ནས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་སྐྱེད་པར་བགྱིད་དེ།
en: Seeing this, they admire the Thus-Gone One, thinking, ‘The qualities of the Thus-Gone One are truly amazing and wondrous!’ With this admiration for the Thus-Gone One, they give rise to the mind set upon unsurpassed and perfect awakening.

source: །བཙུན་པ་རབ་འབྱོར་གཞན་ཡང་དེ་བཞིན་གཤེགས་པ་བསོད་སྙོམས་ལ་རྒྱུ་བ་མཐོང་ན་སེམས་ཅན་དཔག་ཏུ་མེད་པ་ལོངས་སྤྱོད་དང་དབང་ཕྱུག་གིས་རྒྱགས་ཤིང་མྱོས་པ་དང་། གཟུགས་དང་། རིགས་དང་། འཚོ་བ་དང་། ནད་མེད་པས་རྒྱགས་ཤིང་མྱོས་པ་འདི་རྣམས་འདི་སྙམ་དུ་སེམས་ཏེ། འདི་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་སྲིད་བོར་ནས་རབ་ཏུ་བྱུང་ཞིང་བསོད་སྙོམས་ལ་རྒྱུ་ཞེས་གྲགས་ཏེ།
en: “Furthermore, honorable Subhūti, when they see the Thus-Gone One going for alms, countless beings who are conceited and obsessed with resources and power, as well as those who are conceited and obsessed with their looks, caste, livelihood, and health, think, ‘It is said that he cast away the kingdom of a universal monarch and became a renunciate going for alms.

source: དེས་ཀྱང་འདི་ལྟར་ང་རྒྱལ་བཅོམ་ན། ཀྱེ་མ་བདག་ཅག་གིས་ཀྱང་ང་རྒྱལ་གཞོམ་པར་བྱའོ་སྙམ་སྟེ། དེ་དག་གིས་དེ་ལྟ་བུ་མཐོང་ནས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་སྐྱེད་པར་བགྱིད་དེ།
en: If he has overcome pride like that, surely we too should vanquish our pride.’ With this observation, they give rise to the mind set upon unsurpassed and perfect awakening.

source: །བཙུན་པ་རབ་འབྱོར་གཞན་ཡང་དེ་བཞིན་གཤེགས་པ་གྲོང་དང་། གྲོང་ཁྱེར་དུ་བསོད་སྙོམས་ལ་རྒྱུ་བ་ན། ལྷ་གཟི་བྱིན་ཆེ་བ་གཟི་བྱིན་ཆེ་བ་རྣམས་ཀྱིས་དགོངས་པ་ལ་བལྟས་ནས་འདི་སྐད་དུ་འདི་ལ་ནི་བཀྲེས་པ་དང་། སྐོམ་པའི་གནོད་པ་ཡང་མེད་ལ། ལུས་ཉམ་ཆུང་བ་ཡང་མེད་ཀྱི།
en: “Furthermore, honorable Subhūti, when the Thus-Gone One goes to hamlets or cities for alms, the majestic and magnificent gods perceive his state of mind and say, ‘He is not afflicted by hunger or thirst, nor is his body weak.

source: སེམས་ཅན་རྣམས་ལ་སྙིང་བརྩེ་བ་ཆེད་ཆེར་བྱས་ནས་བསོད་སྙོམས་ལ་རྒྱུ་བ་མཛད་ཀྱིས།
en: And still, through his ever-increasing affection for others, he goes for alms.

source: བདག་ཅག་ཀྱང་དེ་བཞིན་དུ་སེམས་ཅན་རྣམས་ལ་སྙིང་བརྩེ་བ་ཆེད་ཆེར་བྱ་བའི་སེམས་ཀྱིས་བསོད་སྙོམས་ལ་རྒྱུ་བར་བྱའོ་ཞེས་སྨྲ་ཞིང་དེ་དག་གིས་དེ་ལྟ་བུ་མཐོང་ནས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་སྐྱེད་པར་བགྱིད་དེ།
en: That being so, we too should go for alms in a similar fashion, with a mind of ever-increasing affection for others.’ With this observation, they give rise to the mind set upon unsurpassed and perfect awakening.

source: །བཙུན་པ་རབ་འབྱོར་གཞན་ཡང་སེམས་ཅན་ལེ་ལོ་ཅན་སྙོམ་ལས་ཅན་དེ་བཞིན་གཤེགས་པ་ལ་བལྟ་བ་དང་། ཕྱག་འཚལ་བ་དང་། བསྙེན་བཀུར་བགྱི་བའི་སླད་དུ་མི་མཆི་བ་དེ་དག་དེ་བཞིན་གཤེགས་པ་གྲོང་དང་། གྲོང་ཁྱེར་དུ་གཤེགས་ན་འབད་མི་འཚལ་བར་མཐོང་བར་འགྱུར་ལ།
en: “Furthermore, honorable Subhūti, there are lazy and indolent people who never come to see, pay homage to, and honor the Thus-Gone One. However, when the Thus-Gone One goes to hamlets or cities, they are able to see him effortlessly.

source: མཐོང་ནས་ཀྱང་དགའ་བ་དང་། མཆོག་ཏུ་དགའ་བ་ཆེན་པོ་འཐོབ་པར་འགྱུར་ཏེ།
en: Then, seeing him in this way, they experience intense pleasure and joy.

source: དགའ་བ་དང་མཆོག་ཏུ་དགའ་བ་ཐོབ་ནས་ཀྱང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་སྐྱེད་པར་བགྱིད་དེ།
en: With that feeling of intense pleasure and joy, they give rise to the mind set upon unsurpassed and perfect awakening.

source: །བཙུན་པ་རབ་འབྱོར་གཞན་ཡང་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ནི་མཐོང་ན་དོན་ཡོད་པ་སྟེ།
en: “Furthermore, honorable Subhūti, the blessed buddhas are meaningful to behold.

source: ཐ་ན་སེམས་ཅན་གང་དག་གིས་སེམས་ཀྱི་སྐད་ཅིག་གཅིག་ཙམ་ལ་ཞི་བའི་མིག་གིས་དེ་བཞིན་གཤེགས་པ་མཐོང་ན་ཡང་དེ་འབའ་ཞིག་གིས་ཀྱང་དེ་དག་ཐམས་ཅད་ཀྱི་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བར་འགྱུར་བའི་བར་གྱི་རྒྱུར་འགྱུར་ཏེ།
en: If beings even so much as behold the Thus-Gone One with a calm gaze for merely a single conscious moment, this becomes an enduring cause for them to pass into nirvāṇa.

source: །བཙུན་པ་རབ་འབྱོར་གཞན་ཡང་དེ་བཞིན་གཤེགས་པ་གྲོང་དང་། གྲོང་ཁྱེར་དུ་གཤེགས་ན་སེམས་ཅན་བཅིང་པས་བཅིངས་པ་རྣམས་བཅིང་བ་ལས་གྲོལ་བར་འགྱུར་ལ།
en: “Furthermore, honorable Subhūti, when the Thus-Gone One goes to hamlets or cities, those who are bound by fetters are freed from their fetters.

source: དེ་དག་གིས་དེ་བཞིན་གཤེགས་པའི་མཐུས་བདག་ཅག་བཅིང་བ་འདི་དག་ལས་གྲོལ་བར་གྱུར་ཏོ། །ཞེས་ཤེས་ཏེ་དེ་བཞིན་གཤེགས་པ་ལ་བྱས་པ་གཟོ་བ་དང་། བྱས་པ་ཚོར་བར་གྱུར་ནས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་སྐྱེད་པར་བགྱིད་དེ།
en: They think, ‘It is by the power of the Thus-Gone One that we have been freed from these fetters.’ Understanding this, they are appreciative and grateful to the Thus-Gone One, and they give rise to the mind set upon unsurpassed and perfect awakening.

source: བཙུན་པ་རབ་འབྱོར་དེ་བཞིན་གཤེགས་པས་དོན་གྱི་དབང་དེ་གཟིགས་ནས་བསོད་སྙོམས་ལ་རྒྱུ་བ་མཛད་དོ། །བཙུན་པ་རབ་འབྱོར་གཞན་ཡང་རིགས་ཀྱི་བུའམ།
en: It is through considering this great purpose, honorable Subhūti, that the Thus-Gone One goes for alms.

source: རིགས་ཀྱི་བུ་མོ་དེ་བཞིན་གཤེགས་པའི་ཡོན་ཏན་བསྔགས་པ་ཐོས་ན།
en: “Furthermore, honorable Subhūti, when sons and daughters of noble family hear praises of the Thus-Gone One’s qualities, they think, ‘My goodness!

source: ཀྱེ་མ་མ་ལ་བདག་ཅག་གིས་དེ་བཞིན་གཤེགས་པ་ལ་བསོད་སྙོམས་དབུལ་བར་བྱའོ།
en: We must offer alms to the Thus-Gone One.

source: །ཆོས་གོས་དབུལ་བ་དང་། མཆོད་པ་དང་། བཀུར་སྟིར་བྱ་བ་ཅི་ཡང་རུང་བས་མཆོད་པ་བྱའོ་སྙམ་དུ་སེམས་པ་དེ་ལྟ་བུ་དག་མཆིས་ལ་དེ་དག་ལས་ཀྱང་མས་བསྲུངས་པའམ།
en: Let’s give him Dharma robes, make offerings, and show respect. Let’s make offerings with whatever is suitable.’ And those who think this way go to see him.

source: ཕས་བསྲུངས་པའམ། མིང་པོས་བསྲུངས་པའམ། ཕུ་ནུ་མོས་བསྲུངས་པའམ། ཁྱིམ་ཐབ་ཀྱིས་བསྲུངས་པའམ།
en: But there are also those who are under the protection of mothers, fathers, elder siblings, spouses, and partners.

source: མཛའ་བོས་བསྲུངས་པ་རྣམས་དེ་དང་དེའི་རྐྱེན་གྱིས་དེ་བཞིན་གཤེགས་པའི་ཐད་དུ་མཆི་མི་ནུས་ཏེ།
en: Due to such circumstances, they cannot go directly before the Thus-Gone One.

source: དེ་དག་གིས་དེ་བཞིན་གཤེགས་པ་གྲོང་དང་། གྲོང་ཁྱེར་དུ་གཤེགས་པ་མཐོང་ན་ཚིམ་ཞིང་མགུ་ལ་རབ་ཏུ་དགའ་ཞིང་དགའ་བ་དང་ཡིད་བདེ་བ་སྐྱེས་ནས་དེ་བཞིན་གཤེགས་པ་ལ་བསོད་སྙོམས་དབུལ་བར་བགྱིད་དོ།
en: Instead, when they see that the Thus-Gone One has come to their hamlet or city, they feel fulfilled and gladdened. Extremely delighted, they experience joy and happiness, and they offer alms to the Thus-Gone One.

source: །ཕུལ་ནས་ཀྱང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་སྐྱེད་པར་བགྱིད་དེ།
en: Moreover, having offered, they give rise to the mind set upon unsurpassed and perfect awakening.

source: །བཙུན་པ་རབ་འབྱོར་གཞན་ཡང་དེ་བཞིན་གཤེགས་པ་ལ་རྒྱལ་ཆེན་བཞིའི་རིས་ཀྱི་ལྷ་རྣམས་ཀྱིས་ལྷུང་བཟེད་ཕུལ་ནས་དེ་བཞིན་གཤེགས་པས་བཞེས་པ་མཆིས་ཏེ།
en: “Furthermore, honorable Subhūti, the gods in the realm of the Four Great Kings offered an alms bowl to the Thus-Gone One, and he accepted it.

source: དེར་སེམས་ཅན་ལོངས་སྤྱོད་ཆུང་བ་དང་། ཆུང་ངུ་སྦྱིན་པར་འཚལ་བ་གང་དག་ལགས་པ་དེ་དག་གིས་ནི་དེ་བཞིན་གཤེགས་པའི་ལྷུང་བཟེད་གང་བར་མཐོང་ངོ་།
en: When beings of meager resources with only little to give, whoever they may be, see the Thus-Gone One’s alms bowl they perceive it as full.

source: །སེམས་ཅན་ལོངས་སྤྱོད་ཆེ་ཞིང་མང་དུ་སྦྱིན་པར་འཚལ་བ་གང་དག་ལགས་པ་དེ་དག་གིས་ནི་དེ་བཞིན་གཤེགས་པའི་ལྷུང་བཟེད་མ་གང་བར་མཐོང་ནས་དེ་དག་གིས་ཇི་ཙམ་དགོས་པ་ཕུལ་ཏེ།
en: However, beings of greater resources with much to give, whoever they may be, see the Thus-Gone One’s alms bowl as not full, and so they offer as much as necessary.

source: ལྷུང་བཟེད་གང་བར་བགྱིས་ནས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་སྐྱེད་པར་བགྱིད་དེ།
en: Having filled his alms bowl, they give rise to the mind set upon unsurpassed and perfect awakening.

source: །བཙུན་པ་རབ་འབྱོར་གཞན་ཡང་དེ་བཞིན་གཤེགས་པའི་ལྷུང་བཟེད་ཀྱི་ནང་དུ་བཅའ་བ་དང་། བཟའ་བ་དང་། མྱང་བར་བྱ་བ་རོ་བརྒྱ་དང་ལྡན་པ་བླུགས་ན། བཅའ་བ་དང་། བཟའ་བ་དང་། མྱང་བར་བྱ་བ་དེ་དག་འདྲེ་བར་མི་འགྱུར་ཏེ། ཇི་ལྟར་སྣོད་ཐ་དད་པའི་ནང་ན་མཆིས་པ་དེ་ཁོ་ན་བཞིན་དུ་མཆིས་ཏེ།
en: “Furthermore, honorable Subhūti, when many delicious foods are placed into the Thus-Gone One’s alms bowl, they do not become mixed, but remain apart, as if they were in separate containers.

source: དེར་ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མིའམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་མང་པོ་དག་གིས་དེ་བཞིན་གཤེགས་པའི་ལྷུང་བཟེད་ཀྱི་ཆོ་འཕྲུལ་དེ་ལྟ་བུ་མཐོང་ནས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་སྐྱེད་པར་བགྱིད་དེ།
en: Many gods, nāgas, yakṣas, gandharvas, asuras, garuḍas, kinnaras, and mahoragas behold such miracles of the Thus-Gone One’s alms bowl, and thereby give rise to the mind set upon unsurpassed and perfect awakening.

source: །བཙུན་པ་རབ་འབྱོར་གཞན་ཡང་དེ་བཞིན་གཤེགས་པའི་ལྷུང་བཟེད་ཀྱི་ནང་དུ་དགེ་སློང་ཐམས་ཅད་ཀྱི་ཟས་བླུགས་ཀྱང་དེས་ལྷུང་བཟེད་དེ་མ་གང་བ་འམ། གང་བར་ཡང་མི་འགྱུར་ཏེ།
en: “Furthermore, honorable Subhūti, even if the food of all the monks is put into the Thus-Gone One’s alms bowl, it is not filled, nor will it ever become full.

source: དེར་ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མིའམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་མང་པོ་དག་གིས་དེ་བཞིན་གཤེགས་པའི་ལྷུང་བཟེད་ཀྱི་ཆོ་འཕྲུལ་དེ་ལྟ་བུ་མཐོང་སྟེ་ངོ་མཚར་དུ་གྱུར་ནས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་སྐྱེད་པར་བགྱིད་དེ།
en: Many gods, nāgas, yakṣas, gandharvas, asuras, garuḍas, kinnaras, and mahoragas behold such miracles of the Thus-Gone One’s alms bowl. They are amazed and give rise to the mind set upon unsurpassed and perfect awakening.

source: དེ་བཞིན་གཤེགས་པས་དོན་གྱི་དབང་དེ་གཟིགས་ནས་བསོད་སྙོམས་ལ་རྒྱུ་བ་མཛད་དོ།
en: It is through considering this great purpose, honorable Subhūti, that the Thus-Gone One goes for alms.

source: །བཙུན་པ་རབ་འབྱོར་གཞན་ཡང་དེ་བཞིན་གཤེགས་པའི་སྐུ་ནི་གཅིག་ཏུ་མཁྲེགས་ཤིང་ཁོང་སྟོང་མ་ལགས་ལ་རྡོ་རྗེ་ལྟར་མཁྲེགས་པ་སྟེ།
en: “Furthermore, honorable Subhūti, the Thus-Gone One’s body is solid throughout; it is not hollow, but solid like a vajra.

source: དེ་བཞིན་གཤེགས་པའི་སྐུ་ལ་ཕོ་བ་འམ། ལོང་ཀ་ཡང་མི་མངའ། ཕྱིས་ཡང་མི་མངའ། གཅིན་ཡང་མི་མངའ་མོད་ཀྱི། འོན་ཀྱང་བསོད་སྙོམས་ལ་རྒྱུ་བ་དང་། བཤོས་གསོལ་བ་དེ་ལྟར་ཡང་གདའ་ལ་ཁོང་དུ་མིད་པ་ཡང་མི་མངའ་སྟེ།
en: Although the body of the Thus-Gone One has no stomach, intestines, excrement, or urine, he nevertheless goes for alms and eats food.

source: ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མིའམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་དང་། མི་དང་། མི་མ་ཡིན་པ་མང་པོ་དག་གིས་དེ་མཐོང་ནས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་སྐྱེད་པར་བགྱིད་དེ།
en: Even so, he does not swallow the food. Many gods, nāgas, yakṣas, gandharvas, asuras, garuḍas, kinnaras, mahoragas, humans, and nonhumans witness this and thereby give rise to the mind set upon unsurpassed and perfect awakening.

source: བཙུན་པ་རབ་འབྱོར་དེ་བཞིན་གཤེགས་པས་དོན་གྱི་དབང་དེ་གཟིགས་ནས་བསོད་སྙོམས་ལ་རྒྱུ་བ་མཛད་དེ།
en: It is through considering this great purpose, honorable Subhūti, that the Thus-Gone One goes for alms.

source: བཙུན་པ་རབ་འབྱོར་གཞན་ཡང་དེ་བཞིན་གཤེགས་པ་གྲོང་དང་། གྲོང་ཁྱེར་དུ་གཤེགས་ན་སེམས་ཅན་མང་པོ་དག་གིས་བསོད་སྙོམས་མང་པོ་འམ། ཉུང་ངུའམ། བཟང་པོ་འམ། ངན་པ་ཡང་རུང་སྟེ། དབུལ་བར་བགྱིད་ལ།
en: “Furthermore, honorable Subhūti, when the Thus-Gone One goes to hamlets or cities, many beings offer alms, whether a lot or a little, excellent or poor.

source: སེམས་ཅན་དེ་དག་གིས་ཀྱང་དེ་བཞིན་གཤེགས་པ་ལ་བསྐྱེད་པའི་ཡོན་ཏན་རྣམས་མཐར་ཐུག་པར་བགྱིད་མི་ནུས་ཏེ། ལྷ་དང་མི་རྣམས་ཀྱི་ཕུན་སུམ་ཚོགས་པ་མང་པོ་དག་ཀྱང་ཉམས་སུ་མྱོང་བར་འགྱུར་ལ་ཡོན་ཏན་དེ་ཡང་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བར་འགྱུར་བའི་བར་དུ་བས་པར་མི་འགྱུར་ཏེ།
en: Although those beings may be unable to perfect all the qualities that the Thus-Gone One possesses, they do experience many of the pleasures of gods and humans. And those qualities are not exhausted until they pass into nirvāṇa.

source: །བཙུན་པ་རབ་འབྱོར་གཞན་ཡང་དེ་བཞིན་གཤེགས་པ་ནི་རྟག་ཏུ་མཉམ་པར་བཞག་པ་སྟེ་ཏིང་ངེ་འཛིན་ལས་ཉམས་པ་མི་མངའ་ལ།
en: “Furthermore, honorable Subhūti, the Thus-Gone One is perpetually in equipoise and never leaves the state of absorption.

source: དེར་ཚངས་པ་འམ། དེ་མ་ཡིན་པའི་གཟུགས་ན་སྤྱོད་པའི་ལྷ་གཟི་བྱིན་ཆེ་བ་གཟི་བྱིན་ཆེ་བ་རྣམས་ཀྱིས་དེ་བཞིན་གཤེགས་པ་བསོད་སྙོམས་ལ་རྒྱུ་ཞིང་ཏིང་ངེ་འཛིན་ལས་ཀྱང་མི་གཡོ་བ་མཐོང་ན་དེ་དག་འདི་སྙམ་དུ་སེམས་ཏེ། འདི་ནི་སེམས་ཅན་གྱི་དོན་ལ་བརྩོན་པ་ཡིན་གྱི། ཟས་འདོད་པ་མ་ཡིན་པར་ཐེ་ཙོམ་མེད་དོ་སྙམ་ནས་དེ་དག་དགའ་བ་ཐོབ་ནས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་སྐྱེད་པར་བགྱིད་དེ།
en: When Brahmā or other majestic and magnificent gods of the form realm see the Thus-Gone One going for alms without wavering from his absorption, they think, ‘He exerts himself for the welfare of beings, but surely he does not long for food.’ With this thought they are elated and give rise to the mind set upon unsurpassed and perfect awakening.

source: །བཙུན་པ་རབ་འབྱོར་གལ་ཏེ་དེ་བཞིན་གཤེགས་པ་བསོད་སྙོམས་ལ་རྒྱུ་བ་མི་མཛད་དེ། ཞལ་ཟས་ཀྱང་མི་གསོལ་བར་གྱུར་ན་ནི་དེ་ལྟ་ན་རིགས་ཀྱི་བུ་དང་། རིགས་ཀྱི་བུ་མོ་ལེགས་པར་གསུངས་པའི་ཆོས་འདུལ་བ་ལ་ཁྱིམ་ནས་ཁྱིམ་མེད་པར་རབ་ཏུ་བྱུང་བ་དེ་དག་ཀྱང་ཟས་མི་ཟ་བ་ལ་ཞུགས་ཏེ།
en: “If, honorable Subhūti, the Thus-Gone One neither went for alms nor ate food, then those sons and daughters of noble family who have gone forth and renounced the householder’s life for the sake of the well-spoken Dharma and Vinaya would also not eat.

source: བདག་ཅག་ཀྱང་བསོད་སྙོམས་ལ་རྒྱུ་བར་མི་བྱ།
en: They would think, ‘We, too, should not go for alms;

source: ཟས་ཀྱང་བཟའ་བར་མི་བྱའོ་སྙམ་ནས་དེ་དག་ཀྱང་བཀྲེས་ཤིང་ཉམ་ཆུང་བར་གྱུར་པས་ཁྱད་པར་ཐོབ་པར་རྟོགས་པར་མི་ནུས་ཏེ།
en: we, too, should not eat.’ In that way they would go hungry and grow feeble and therefore be unable to realize the unique attainment.

source: དེ་དག་གིས་མ་འོངས་པ་ན་ཁྱད་པར་འཐོབ་པའི་བསམ་པ་རྫོགས་པར་མཛད་པའི་ཕྱིར་ཡང་དེ་བཞིན་གཤེགས་པ་བསོད་སྙོམས་ལ་རྒྱུ་ཞིང་གསོལ་བར་མཛད་དོ།
en: It is with their future accomplishment of the unique attainment in mind that the Thus-Gone One goes for alms and partakes of food.

source: །བཙུན་པ་རབ་འབྱོར་དེ་བཞིན་གཤེགས་པས་དོན་གྱི་དབང་དེ་གཟིགས་ནས་བསོད་སྙོམས་ལ་རྒྱུ་བ་མཛད་དོ།
en: It is through considering this great purpose, honorable Subhūti, that the Thus-Gone One goes for alms.

source: །བཙུན་པ་རབ་འབྱོར་གཞན་ཡང་དེ་བཞིན་གཤེགས་པ་ནི་འཕགས་པའི་རིགས་རྣམས་ཡང་དག་པར་ཡོངས་སུ་གཟུང་བའི་ཕྱིར་བསོད་སྙོམས་ལ་རྒྱུ་བ་མཛད་དོ།
en: “Furthermore, honorable Subhūti, the Thus-Gone One goes for alms in order to fully care for those in the family of the noble ones.

source: །བཙུན་པ་རབ་འབྱོར་གཞན་ཡང་དེ་བཞིན་གཤེགས་པ་ནི་སྐྱེ་བོ་ཕྱི་མ་རྣམས་ལ་ཐུགས་བརྩེ་བའི་ཕྱིར་བསོད་སྙོམས་ལ་རྒྱུ་སྟེ།
en: “Furthermore, honorable Subhūti, it is because of his affection for future beings that the Thus-Gone One goes for alms.

source: ཕྱི་མའི་དུས་ན་བྲམ་ཟེ་དང་། ཁྱིམ་བདག་མ་དད་པ་རྣམས་འདི་སྐད་དུ་གལ་ཏེ་འདི་དག་གི་སྟོན་པ་ཉིད་ཀྱིས་ཀྱང་བསོད་སྙོམས་ལ་རྒྱུ་བ་མ་བྱས་ན་འདི་དག་ཅིའི་ཕྱིར་བསོད་སྙོམས་ལ་རྒྱུ་བར་བྱེད་ཅེས་དེ་དག་དགེ་སློང་དང་། དགེ་སློང་མ་རྣམས་ལ་ཤས་ཆེར་མི་དགའ་བར་མི་འགྱུར་བར་བྱ་བའི་ཕྱིར་རོ། །དེ་བས་ན་དེ་དག་ཀྱང་འདི་སྙམ་དུ་སེམས་ཏེ། འདི་དག་གི་སྟོན་པས་ཀྱང་བསོད་སྙོམས་ལ་རྒྱུ་བར་བྱས་ན་འདི་དག་ཅིའི་ཕྱིར་བསོད་སྙོམས་ལ་རྒྱུ་བར་མི་བྱེད་སྙམ་སྟེ། དེ་དག་གིས་བསྔགས་པ་ཡང་རྗོད་པར་བགྱིད་ལ། བསོད་སྙོམས་ཡང་སྟེར་བར་འགྱུར་ཏེ།
en: Otherwise, in the future faithless priests and householders would feel strong aversion for monks and nuns, saying, ‘Why do they go for alms if their teacher himself did not?’ Now they will instead think, ‘If even their teacher went for alms, why should they not as well?’ Thus, they will utter praise and give alms.

source: འདི་སྐད་དུ་བསོད་སྙོམས་ལ་རྒྱུ་བ་འདི་ནི་གཙུག་ལག་ལས་འབྱུང་བའི་བསོད་སྙོམས་ཡིན་ནོ།
en: They will say, ‘Going for alms is indeed a sacred tradition.

source: །སྤྱོད་པ་འདི་ནི་དེ་བཞིན་གཤེགས་པས་བསྔགས་པ་ཡིན་ནོ་ཞེས་ཀྱང་སྨྲ་བར་འགྱུར་ཏེ། བཙུན་པ་རབ་འབྱོར་དེ་བཞིན་གཤེགས་པས་དོན་གྱི་དབང་དེ་གཟིགས་ནས་བསོད་སྙོམས་ལ་རྒྱུ་བ་མཛད་དོ།
en: This practice was praised by the Thus-Gone One.’ It is through considering this great purpose, honorable Subhūti, that the Thus-Gone One goes for alms.

source: །བཙུན་པ་རབ་འབྱོར་གཞན་ཡང་རྒྱལ་པོ་དང་། བློན་པོ་དང་། བྲམ་ཟེ་དང་། ཁྱིམ་བདག་དང་། བློན་པོའི་བུ་རྣམས་ལས་ལེགས་པར་གསུངས་པའི་ཆོས་འདུལ་བ་ལ་དད་པས་ཁྱིམ་ནས་ཁྱིམ་མེད་པར་རབ་ཏུ་བྱུང་བ་དེ་དག །བདག་ཅག་ནི་འདི་ལྟར་རིགས་ཆེན་པོར་སྐྱེས་པ་ཡིན་ན། ཟས་ཀྱི་ཕྱིར་ཁྱིམ་ནས་ཁྱིམ་དུ་བསོད་སྙོམས་ལ་ཅིའི་ཕྱིར་རྒྱུ་བར་བྱ་སྙམ་སྟེ། ངོ་ཚ་ནས་བསོད་སྙོམས་ལ་རྒྱུ་བར་མི་བགྱིད་པ་དེ་དག་དེ་བཞིན་གཤེགས་པའི་བསོད་སྙོམས་དང་། གཟི་བྱིན་དང་ལྡན་པའི་སྐུའི་རྗེས་སུ་སློབ་ཅིང་བསོད་སྙོམས་ལ་རྒྱུ་བར་འགྱུར་ཏེ།
en: “Furthermore, honorable Subhūti, there are those who have renounced their householder’s lives as kings, ministers, priests, householders, and sons of ministers and have gone forth out of faith in the well-spoken Dharma and Vinaya. Out of shame, they might not go for alms, thinking, ‘If we have been born into such high castes, why should we go from house to house for alms?’ But this way they can go for alms, following in the footsteps of the Thus-Gone One, who himself went for alms in all his majesty.

source: །བཙུན་པ་རབ་འབྱོར་གཞན་ཡང་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱིས་ནི་འཇིག་རྟེན་དང་འཐུན་པར་མཛད་འཚལ་ཏེ།
en: “Furthermore, honorable Subhūti, the thus-gone ones intend to act in accord with the world.

source: ཇི་ལྟ་ཇི་ལྟར་སེམས་ཅན་རྣམས་ཡོངས་སུ་སྨིན་པར་འགྱུར་བ་དེ་ལྟ་དེ་ལྟར་འཐུན་པར་མཛད་དེ།
en: They act in whichever way brings beings to maturity.

source: །བཙུན་པ་རབ་འབྱོར་གཞན་ཡང་དེ་བཞིན་གཤེགས་པ་ལ་ནི་སྒྲིབ་པའམ། སྐྱེམས་པ་ཡང་མི་མངའ། ཉམ་ཆུང་བ་ཡང་མི་མངའ། ཆགས་པ་ཡང་མི་མངའ། ཆགས་པར་འགྱུར་བ་ཡང་མི་མངའ།
en: “Furthermore, honorable Subhūti, the Thus-Gone One is without obscurations, thirst, feebleness, attachment, or anything that could become attachment.

source: སྡིག་པ་བཞེད་པ་ཡང་མ་ལགས། སོགས་པ་ཡང་མི་མངའ་མོད་ཀྱི།
en: He has no wish for negative deeds, and he does not accumulate negativity.

source: འོན་ཀྱང་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ནི་འཇིག་རྟེན་དང་འཐུན་པར་མཛད་པ་དང་། སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་མཛད་པའི་སླད་དུ་བསོད་སྙོམས་ལ་རྒྱུ་བ་མཛད་དེ།
en: Nevertheless, the thus-gone, worthy, and perfect Buddha goes for alms in order to act in accord with the world and bring beings to full maturity.

source: བཙུན་པ་རབ་འབྱོར་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱིས་དོན་གྱི་དབང་དེ་གཟིགས་ནས་བསོད་སྙོམས་ལ་རྒྱུ་བ་མཛད་ན།
en: It is through considering this great purpose, honorable Subhūti, that the thus-gone, worthy, and perfect Buddha goes for alms.

source: བཙུན་པ་རབ་འབྱོར་དེ་ལྟ་བུའི་ཐབས་དང་དེ་ལྟ་བུའི་སྙིང་རྗེ་ཆེན་པོ་དང་། དེ་ལྟ་བུའི་དོན་ཡོངས་སུ་དག་པ་སུ་བསོད་སྙོམས་ལ་རྒྱུ་བར་སྤྱོད་དམ། སྨྲས་པ།
en: “That being so, honorable Subhūti, do you also go for alms with such skillfulness, such great compassion, and such pure purpose?”

source: ཆེ་ཞེ་བདག་གིས་ནི་འདི་མི་ནུས་ཏེ།
en: “No, elder sister, I am incapable of that.

source: ཆེ་ཞེ་དཔེར་ན་ཁྱི་དང་བྱི་ལ་ཐམས་ཅད་ཀྱིས་རིའི་རྒྱལ་པོ་རི་རབ་གཞིག་པར་མི་ནུས་པ་དང་། ཝ་ཐམས་ཅད་ཀྱིས་རི་དགས་ཀྱི་རྒྱལ་པོ་སེང་གེ་ལ་བསྐལ་པའི་བར་དུ་ཡང་མཐུ་རྩལ་ལམ་སྒྲ་བསྒྲགས་པ་བསྟན་པར་མི་ནུས་པ་དེ་བཞིན་དུ།
en: To give an analogy, elder sister, there are no dogs or cats capable of destroying Mount Meru, the king of mountains. And there are no foxes capable, even over the course of eons, of teaching the lion, the king of beasts, how to obtain its powerful abilities and its resounding roar.
